
Процедура ДополнитьФорму (Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеКонтактноеЛицоВГруппаВШапкаПраво(Форма);
		ДобавитьГруппаСкидкаВГруппаВШапкаЛево(Форма);
		ДобавитьПолеКонтактноеЛицоВГруппаСкидка(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаВШапкаПраво(Форма);
    ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаВШапкаПраво(Форма);
	КонецЕсли;
	
КонецПроцедуры 
	
Процедура ДобавитьПолеКонтактноеЛицоВГруппаВШапкаПраво(Форма) 
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Расш1_КонтактноеЛицо"; 
	
КонецПроцедуры  

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)    
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Расш1_КонтактноеЛицо";
	
КонецПроцедуры  

Процедура ДобавитьПолеКонтактноеЛицоВГруппаСкидка(Форма) 
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Расш1_СогласованнаяСкидка"; 
	ПолеВвода.УстановитьДействие("ПриИзменении", "Расш1_СогласованнаяСкидкаПриИзменении");
	
КонецПроцедуры 

Процедура ДобавитьГруппаСкидкаВГруппаВШапкаЛево(Форма)
	
	Группа = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
КонецПроцедуры 
